# SetParameterValue Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Subelement..::..SetParameterValue Method
Subelement Class See Also
---
Sets a new parameter value of this subelement given a parameter id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public void SetParameterValue(
	ElementId parameterId,
	ParameterValue pValue
)
```

Visual Basic
---
```text
Public Sub SetParameterValue ( _
	parameterId As ElementId, _
	pValue As ParameterValue _
)
```

Visual C++
---
```text
public:
void SetParameterValue(
	ElementId^ parameterId,
	ParameterValue^ pValue
)
```

# ### Parameters
parameterId
    Type: Autodesk.Revit.DB..::..ElementId Parameter id.
pValue
    Type: Autodesk.Revit.DB..::..ParameterValue New value for the parameter.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | parameterId does not identify a valid parameter of this subelement. -or- The parameter parameterId is not modifiable for this subelement. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Subelement Class
Autodesk.Revit.DB Namespace